#include <stdio.h>
#include <locale.h>

int main(void){

    setlocale(65001, "pt_BR.UTF-8");

    // Операции присвоения

    int x = 2 + 5;
    printf("Базовая операция присвоения:\nint x = 2 + 5\nx = %d\n\n", x);

    int a, b, c;
    a = b = c = 34 + 7;
    printf("Множественное присвоение:\nint a, b, c;\na = b = c = 34 + 7\nc = %d\nb = %d\na = %d\n\n", c, b, a);

    printf(""
        "Список сочетаний операций с оператором присвоения:\n\n"
        "# += # - эквивалентно: a = a + b\n"
        "# -= # - эквивалентно: a = a - b\n"
        "# *= # - эквивалентно: a = a * b\n"
        "# /= # - эквивалентно: a = a / b\n"
        "# %%= # - эквивалентно: a = a %% b\n"
        "# <<= # - эквивалентно: a = a << b\n"
        "# >>= # - эквивалентно: a = a >> b\n"
        "# &= # - эквивалентно: a = a & b\n"
        "# |= # - эквивалентно: a = a | b\n"
        "# ^= # - эквивалентно: a = a ^ b\n"
    ""); // Тут я применил комбинированный тип строки

    return 0;
}